{
  "meta": {
    "title": "Kumuluz"
  },
  "header": {
    "main-title": "<strong>Pospešite</strong> razvoj svojih <strong>digitalnih produktov</strong> s platformo Kumuluz",
    "subtitle": "Uresničite svojo digitalno strategijo",
    "tiles": {
      "buttons": {
        "play-video": "Predvajaj video",
        "learn-more": "Več"
      },
      "left-tile": {
        "above-title": "POSLOVNI APLIKACIJSKI PROGRAMSKI VMESNIKI KUMULUZ",
        "title": "API rešitve za takojšnjo uporabo",
        "subtitle": "Uporabite že razvite poslovne API-je in tako veliko hitreje ustvarite svoje digitalne izdelke in storitve."
      },
      "right-tile": {
        "above-title": "DIGITALNA PLATFORMA KUMULUZ",
        "title": "Pospešite svojo digitalno transformacijo",
        "subtitle": "Lahka, odprta in nagrajena digitalna platforma, ki jo razvojne ekipe obožujejo."
      }
    }
  },
  "content": {
    "title": "Vsi gradniki, ki jih potrebujete za svojo digitalno transformacijo",
    "text": "Kumuluz zagotovlja vse gradnike, ki jih potrebujete za realizacijo vaše digitalne transformacije. Vse, od modernizacije obstoječe programske opreme do orodij za veliko hitrejši razvoj novih digitalnih izdelkov in aplikacij.",
    "blog-link": "Naš blog"
  },
  "digitalLandscapeCompetition": {
    "title": "Z izdelki skupine Kumuluz premagajte svojo konkurenco v digitalnem okolju",
    "item-1": {
      "title": "300 % hitrejši vstop na trg za vaše digitalne aplikacije",
      "content": "Z že razvitimi poslovnimi API-ji, mikrostoritvami in oblačno arhitekturo, agilnim pristopom in metodologijo DevOps se za vašo aplikacijo čas vstopa na trg drastično skrajša."
    },
    "item-2": {
      "title": "Ustvarite digitalne, fleksibilne in prilagodljive aplikacije",
      "content": "Razvijte prave digitalne aplikacije, ki so popolnoma fleksibilne, se lahko hitro prilagodijo potrebam strank in potrebam vaše digitalne strategije, že med samim procesom digitalne transformacije."
    },
    "item-3": {
      "title": "Zagrabite nove poslovne priložnosti in digitalne poslovne modele",
      "content": "Na eni sami platformi lahko enostavno povežete svoje aplikacije, naprave ali karkoli drugega, kar želite. Integracija še nikoli ni bila tako enostavna. Dodajte disruptivne digitalne poslovne procese ter jih integrirajte z obstoječimi aplikacijami in managementom poslovnih procesov."
    },
    "item-4": {
      "title": "Svojim strankam redno ponujajte nove funkcionalnosti",
      "content": "Hitro in agilno lansirajte nove funkcionalnosti za svoje digitalne izdelke in storitve, vsak dan ali celo vsakih nekaj ur. Vaša programska oprema je končno lahko dovolj fleksibilna, da se prilagodi vsem hitrim spremembam na trgu. Nenehno inovirajte in čim hitreje naredite prehod od koncepta do denarja."
    },
    "item-5": {
      "title": "Razumite potrebe svojih strank in se temu primerno odzovite",
      "content": "Izkoristite digitalne kanale za resnično razumevanje potreb vaših strank in to v zelo kratkem času. Zaznajte potrebe strank, izboljšajte povratne informacije in se takoj odzovite."
    },
    "item-6": {
      "title": "Uporabite najsodobnejše digitalne tehnologije",
      "content": "V celoti uporabite moderne digitalne tehnologije, vključno z mobilnimi, spletnimi in oblačnimi tehnologijami, aplikacijskimi programskimi vmesniki, internetom stvari, industrijo 4.0, veriženjem blokov, umetno inteligenco …"
    },
    "item-7": {
      "title": "Izboljšajte odpornost in obseg",
      "content": "Občutno zmanjšajte število okvar in izboljšajte odpornost na napake. Brezskrbno in dinamično skalirajte svoje aplikacije, medtem ko se vaš krog strank veča."
    },
    "item-8": {
      "title": "Prenovite svojo platformo in optimizirajte razvojna sredstva",
      "content": "Najboljše od vsega je, da ne rabite začeti iz nič, saj namesto tega lahko uporabite obstoječe rešitve in aplikacije ter naredite prehod na novejšo platformo mikrostoritev in oblačnih rešitev."
    },
    "item-9": {
      "title": "Uveljavite svojo digitalno konkurenčno prednost",
      "content": "Uveljavite digitalno konkurenčno prednost, ki vam bo omogočila, da boste s svojo digitalno transformacijo hitrejši, agilnejši in uspešnejši kot vaša konkurenca. Zmagajte v digitalnem gospodarstvu."
    },
    "item-10": {
      "title": "",
      "content": ""
    }
  },
  "bapis": {
    "title": "Poslovni aplikacijski programski vmesniki Kumuluz",
    "subtitle": "Ni potrebe, da razvijate iz nič. Pospešite svoj razvoj z že razvitimi funkcionalnostmi, ki jih potrebuje vsaka aplikacija, tako da dodate Kumuluz poslovne aplikacijske programske vmesnike.",
    "needs": {
      "title": "Ali vaša aplikacija potrebuje kaj od sledečega?",
      "item-1": "Plačevanje",
      "item-2": "Katalog izdelkov",
      "item-3": "Nakupovalna košarica",
      "item-4": "Upravljanje z naročili",
      "item-5": "Izpolnjevanje naročil",
      "item-6": "Izdajanje računov",
      "item-7": "Upravljanje odnosov s strankami",
      "item-8": "Komunikacija s strankami",
      "item-9": "Upravljanje naročnine",
      "item-10": "Proces spoznavanja strank",
      "browse": "Pregled API-jev"
    },
    "learn-more": {
      "title": "Več",
      "item-1": "Primeri uporabe",
      "item-2": "Primeri kode",
      "item-3": "Cenik",
      "item-4": "E-Trgovina",
      "item-5": "Podpora"
    }
  },
  "digital-platform": {
    "title": "Digitalna platforma Kumuluz",
    "subtitle": "Vse, kar potrebujete, da pospešite svojo digitalno transformacijo, je odprta in lahka digitalna platforma.",
    "items": {
      "ee": "Mikrostoritveno ogrodje – Prenesite svoje monolitne javanske aplikacije v ogrodje mikrostoritev",
      "api": "Management vmesnikov API – Upravljajte z API-ji in okrepite poslovanje z API ekonomijo",
      "integration": "Integracijska platforma – Integrirajte digitalne rešitve, internet stvari in zaledne sisteme",
      "ux": "UX ogrodje z integriranim managementom poslovnih procesov – Na preprost način razvijte sofisticirane in odzivne uporabniške izkušnje",
      "marketplace": "Ogrodje za digitalno tržišče – Hitro razvijte prilagojena digitalna tržišča in pospešite svoje poslovanje",
      "crowdsensing": "Platforma, ki bo s pomočjo tehnologije veriženja blokov zbrala in analizirala podatke o množicah – Pridobite nove poglobljene podatki o vaših strankah z mobilnim zajemom"
    }
  },
  "highlights": {
    "item-1": "Za organizacije, ki prehajajo na mikrostoritve in arhitekturo v oblaku",
    "item-2": "Popolnoma odprta, brez kakršnekoli odvisnosti od ponudnika",
    "item-3": "Nameščena na lokaciji (v vašem podatkovnem središču) ali v oblaku",
    "item-4": "Ohrani investicijo v vaše obstoječe znanje in veščine",
    "item-5": "Minimalno predplačilo in popolnoma fleksibilna naložba",
    "item-6": "Podpora in vzdrževanje 24/7"
  },
  "awards": {
    "title": "Nagrade, ki jih je dobil Sunesisov Kumuluz"
  },
  "other-products": {
    "title": "NAŠI DRUGI IZDELKI, STORITVE IN SKUPNOST",
    "tiles": {
      "learn-more": "Več",
      "first-tile": {
        "above-title": "NAŠE STORITVE",
        "title": "Lahko vam pomagamo realizirati vašo digitalno strategijo",
        "para": "Ponujamo širok izbor storitev na področju svetovanja za IT ter izobraževanja in storitev za razvoj programske opreme, ki podjetjem omogočajo hitrejšo digitalno transformacijo, prav tako pa ponujamo storitve, povezane s prehodom na oblak, prehodom z monolitne na mikrostoritveno arhitekturo, modernizacijo programske opreme in razvojem novih digitalnih izdelkov."
      },
      "second-tile": {
        "above-title": "ODPRTOKODNA SKUPNOST",
        "title": "Pridružite se skupnosti razvijalcev, programerjev in uporabnikov",
        "para": "Naše mikrostoritveno ogrodje (EE) je del skupnosti Microprofile.io."
      },
      "third-tile": {
        "above-title": "DECENTRALIZIRANI API-JI IN TEHNOLOGIJA VERIŽENJA BLOKOV",
        "title": "Resnično decentralizirane aplikacije",
        "para": "Platforma Kumuluz dAPI uvaja popolnoma decentralizirane API-je, ki uporabljajo tehnologijo veriženja blokov."
      }
    }
  },
  "customers": {
    "title": "Kaj naše stranke pravijo o nas",
    "subtitle": "Poskrbite da vas vaša programska oprema nikoli več ne zafrustrira.",
    "adriatic": {
      "text": "Adriatic Slovenica uporablja Kumuluzove API-je in mikrostoritve za integracijo internih sistemov s sistemi partnerjev. Na vmesnikih Kumuluz API sloni trg aplikacijskih programskih vmesnikov za izdelke v zavarovalniški panogi, ki ga trenutno uporablja več kot 3000 partnerskih podjetij v Jugovzhodni Evropi. Adriatic Slovenica v svojih digitalnih kanalih, kot je na primer <a href='https://www.wiz.si/' target='_blank'>Wiz</a>, prav tako uporablja vmesnik Kumuluz Payment za spletna plačila. Kumuluz nam je omogočil lažjo integracijo in večjo produktivnost, ter je zelo pomemben za naše digitalne kanale.",
      "title": "CIO pri Adriatic Slovenici"
    },
    "petrol": {
      "text": "Petrol uporablja Kumuluz kot ogrodje za svoje digitalne izdelke. Kumuluzove mikrostoritve poganjajo inovativne mobilne aplikacije za digitalno okolje, kot je na primer <a href='https://www.petrol.si/mobilna-aplikacija-na-poti' target='_blank'>Na poti</a>, ter kar nekaj nujno potrebnih zalednih sistemov, vključno s Payment, Invoicing, Cart, Order, Fulfillment in Product Catalog. Kumuluz nam je omogočil, da smo pospešili razvoj in skrajšali čas, potreben za vstop na trg. Platforma Kumuluz je postala cenjen del naše strategije za digitalno transformacijo.",
      "title": "CIO pri Petrolu"
    },
    "apl": {
      "text": "Agencija za pospeševanje likvidnosti (APL) uporablja Kumuluz za razvoj platforme za faktoring naslednje generacije. Uporaba Kumuluza je že bistveno izboljšala fleksibilnost, skalabilnost in mobilnost naše programske opreme. S prehodom z monolitske na mikrostoritveno arhitekturo lahko zdaj nove funkcionalnosti dodamo veliko hitreje. S Kumuluzom bomo novo platformo za faktoring lahko razvili trikrat hitreje kot s tradicionalnimi razvojnimi dejavnostmi.",
      "title": "CIO pri APL"
    },
    "couchbase": {
      "text": "KumuluzEE resnično pripelje mikrostoritveno arhitekturo v Javo EE. Modularni spletni vsebnik je pripravljen za Maven, omogoča Fat JAR in modularizirane odvisnosti, ter je pripravljen na vsebnike Docker, kar omogoča, da je lahko takoj nameščen v katerokoli oblačno okolje. Če gradite aplikacije v okolju Java EE, začnite svojo mikrostoritveno pot s platformo KumuluzEE!",
      "title": "Podpredsednik, odnosi z razvijalci pri Couchbase"
    },
    "jclarity": {
      "text": "Četudi so se specifikacije in aplikacijski serverji platforme Java EE zmanjšali, le-ta še vedno ni bila prva tehnološka izbira za mikrostoritvene razvijalce v primerjavi s platformami, kot sta na primer NodeJS ali Spring Boot. To se je sedaj spremenilo, saj KumuluzEE omogoča način ustvarjanja mikrostoritev, ki je lahek in ne potrebuje aplikacijskih serverjev, prav tako pa je podprt s polno močjo storitev Java, JVM in Java EE. Ta inovativen sklad je zaslužen zmagovalec nagrade Duke Awards leta 2015.",
      "title": "Java Champion in CEO pri jClarity"
    },
    "rightrix": {
      "text": "Če iščete mikrostoritve za platformo Java EE, si morate ogledati nov in preprost način, ki vam ga KumuluzEE ponuja za avtomatizacijo mikrostoritev.",
      "title": "Java Champion in ustanovitelj Rightrix Solutions and IndicThreads"
    }

  },
  "references": {
    "title": "Zaupajo nam"
  }
}
